[net]
batch=984
inputs=32
subdivisions=1

learning_rate=0.001
policy=steps
steps=1000
scales=0.9
power=2
max_batches = 200
momentum=0.9
decay=0.0005

swa=1
swa_lr=0.001
swa_start=900

[connected]
output=16
activation=relu

[connected]
output=8
activation=relu

[connected]
output=16
activation=relu

[connected]
output=32
activation=linear

[cost]
scale=-2
