[net]
batch=984
inputs=32
subdivisions=1
notruth=1

learning_rate=0.0001
policy=constant
power=4
max_batches = 30000
momentum=0.9
decay=0.0005
adam=1

swa=0
swa_lr=0.0001
swa_start=28000

[connected]
output=16
activation=relu

[connected]
output=8
activation=relu

[connected]
output=16
activation=relu

[connected]
output=32
activation=linear

[cost]
scale=2
